Catalogs/ПЛ_События.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПЛ_События</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьАктивно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_ИсточникиСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регистратор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеРегистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУсловийРегистрацииСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_ВидыУсловийУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаУсловийРегистрацииСобытия</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиУсловийРегистрацииСобытия</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗадание</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьРегламентнойПроверки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_ПериодичностьРегламентныхПроверок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаРегламентнойПроверки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиРегламентнойПроверки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПодписки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ПЛ_ИсточникиСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПЛ_ИсточникиСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИсточникЗаписьДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникСправочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникРегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегламентнаяПроверка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассылка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПЛ_ПериодичностьРегламентныхПроверок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПЛ_ПериодичностьРегламентныхПроверок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Никогда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КаждыйДень</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КаждуюНеделю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазВДвеНедели</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КаждыйМесяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КаждыйГод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГибкоеРасписание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПЛ_ВидыУсловийУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПЛ_ВидыУсловийУведомлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезУсловия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтборПоИсточнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПЛ_События/Forms/ФормаЭлемента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоНовый = Объект.Ссылка.Пустая();
	ЗначениеКопирования = Параметры.ЗначениеКопирования;
	СозданКопированием = Не ЗначениеКопирования.Пустая();
	
	Если Объект.ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.ИсточникДокумент
		Или Объект.ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.ИсточникЗаписьДокумента Тогда
		Элементы.ПредставлениеРегистратора.Заголовок = "Имя документа";
	ИначеЕсли Объект.ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.ИсточникСправочник Тогда
		Элементы.ПредставлениеРегистратора.Заголовок = "Имя справочника";
	ИначеЕсли Объект.ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.ИсточникРегистрСведений Тогда
		Элементы.ПредставлениеРегистратора.Заголовок = "Регистр сведений";
	КонецЕсли;
	
	Элементы.УсловияРегистрацииСобытия.Доступность = ЗначениеЗаполнено(Объект.Регистратор);
	
	Расписание = Новый РасписаниеРегламентногоЗадания;
	
	Если ЭтоНовый Тогда
		ПриСозданииЧтенииНаСервере();
		Если Не СозданКопированием Тогда
			ДатаНачалаВыполнения = КонецЧаса(ТекущаяДата()) + 1;
			Элементы.НадписьВыполнить.Заголовок = "Выполнить: " + Формат(ДатаНачалаВыполнения, "ДФ=ddd") + ",";
		КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриСозданииЧтенииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(АдресСхемыКомпоновкиДанных) Тогда
		ТекущийОбъект.СхемаУсловийРегистрацииСобытия = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных));
	Иначе
		ТекущийОбъект.СхемаУсловийРегистрацииСобытия = Новый ХранилищеЗначения(Неопределено);
	КонецЕсли;
	Если ЭтоАдресВременногоХранилища(АдресНастроекКомпоновкиДанных) Тогда
		ТекущийОбъект.НастройкиУсловийРегистрацииСобытия = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресНастроекКомпоновкиДанных));
	Иначе
		ТекущийОбъект.НастройкиУсловийРегистрацииСобытия = Новый ХранилищеЗначения(Неопределено);
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресСхемыРегламентнойПроверки) Тогда
		ТекущийОбъект.СхемаРегламентнойПроверки = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресСхемыРегламентнойПроверки));
	Иначе
		ТекущийОбъект.СхемаРегламентнойПроверки = Новый ХранилищеЗначения(Неопределено);
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресНастроекРегламентнойПроверки) Тогда
		ТекущийОбъект.НастройкиРегламентнойПроверки = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресНастроекРегламентнойПроверки));
	Иначе
		ТекущийОбъект.НастройкиРегламентнойПроверки = Новый ХранилищеЗначения(Неопределено);
	КонецЕсли;
	
	Если Объект.ПериодичностьРегламентнойПроверки <> Перечисления.ПЛ_ПериодичностьРегламентныхПроверок.ГибкоеРасписание Тогда
		ЗаполнитьРасписание();
	КонецЕсли;
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Расписание", Расписание);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Запуск", Запуск);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "Завершено_редактирование_условий_события" Тогда
		
		Если ЗначениеЗаполнено(Параметр) Тогда
			ПрименитьИзменениеУсловий(Параметр);
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "Завершено_редактирование_схемы_регламентной_проверки" Тогда
		
		Если ЗначениеЗаполнено(Параметр) Тогда
			ПрименитьИзменениеСхемыРегламентнойПроверки(Параметр);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_События_Для_Уведомлений");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура НаименованиеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	НеСтандартноеНаименование = Истина;
	
	Объект.Наименование = Текст;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникСобытияПриИзменении(Элемент)
	
	Объект.Регистратор = "";
	Объект.ПредставлениеРегистратора = "";
	ХранилищеУсловийРегистрации = Неопределено;
	
	Если Объект.ИсточникСобытия = ПредопределенноеЗначение("Перечисление.ПЛ_ИсточникиСобытий.РегламентнаяПроверка")
		И Не ЗначениеЗаполнено(ДатаНачалаВыполнения) Тогда
		ДатаНачалаВыполнения = КонецЧаса(ТекущаяДата()) + 1;
		Элементы.НадписьВыполнить.Заголовок = "Выполнить: " + Формат(ДатаНачалаВыполнения, "ДФ=ddd") + ",";
	КонецЕсли;
	
	УстановитьВидимостьДоступностьНаСервере();
	НастроитьЗаголовкиПолей();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеРегистратораПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ПредставлениеРегистратора) Тогда
		Объект.Регистратор = "";
	КонецЕсли;
	
	УстановитьВидимостьДоступностьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеРегистратораНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбораРегистратора = Новый Структура("ИсточникСобытия, Регистратор", Объект.ИсточникСобытия, Объект.Регистратор);
	
	ВыбранныйРегистраторСтруктура = ОткрытьФорму("Справочник.ПЛ_События.Форма.ВыборРегистратора",
		ПараметрыВыбораРегистратора,
		Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеРегистратораОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.Регистратор <> ВыбранноеЗначение.Значение Тогда
		
		АдресСхемыКомпоновкиДанных = "";
		АдресНастроекКомпоновкиДанных = "";
		Объект.Регистратор = ВыбранноеЗначение.Значение;
		Объект.ПредставлениеРегистратора = ВыбранноеЗначение.Представление;
		
		СформироватьНаименованиеСобытия();
		УстановитьВидимостьДоступностьНаСервере();
		
		Элементы.УсловияРегистрацииСобытия.Заголовок = "Задать условия обработки события";
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаВыполненияПриИзменении(Элемент)
	
	Если ДатаНачалаВыполнения < ТекущаяДата()
		Или Не ЗначениеЗаполнено(ДатаНачалаВыполнения) Тогда
		ДатаНачалаВыполнения = КонецЧаса(ТекущаяДата()) + 1;
	КонецЕсли;
	
	Элементы.НадписьВыполнить.Заголовок = НСтр("ru = 'Выполнить:'") + " " + Формат(ДатаНачалаВыполнения, "ДФ=ddd") + ",";
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаВыполненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВремяНачалаВыполнения = ДатаНачалаВыполнения;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаВыполненияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДатаНачалаВыполнения = ВыбранноеЗначение + Час(ВремяНачалаВыполнения)*3600 + Минута(ВремяНачалаВыполнения)*60;
	
	Если ДатаНачалаВыполнения < ТекущаяДата()
		Или Не ЗначениеЗаполнено(ДатаНачалаВыполнения)Тогда
		ДатаНачалаВыполнения = КонецЧаса(ТекущаяДата()) + 1;
	КонецЕсли;
	
	Элементы.НадписьВыполнить.Заголовок = "Выполнить: " + Формат(ДатаНачалаВыполнения, "ДФ=ddd") + ",";
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьРегламентнойПроверкиПриИзменении(Элемент)
	
	Если Объект.ПериодичностьРегламентнойПроверки = ПредопределенноеЗначение("Перечисление.ПЛ_ПериодичностьРегламентныхПроверок.ГибкоеРасписание") Тогда
		ИзменитьРасписаниеВДиалоге();
	КонецЕсли;
	
	УстановитьВидимостьДоступностьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаКонцаВыполненияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ДатаКонцаВыполнения) Тогда
		Если ДатаКонцаВыполнения < ДатаНачалаВыполнения Тогда
			ДатаКонцаВыполнения = ДатаНачалаВыполнения;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапускПриИзменении(Элемент)
	
	Если Запуск Тогда
		ДатаНачалаВыполнения = КонецЧаса(ТекущаяДата()) + 1;
		Элементы.НадписьВыполнить.Заголовок = "Выполнить: " + Формат(ДатаНачалаВыполнения, "ДФ=ddd") + ",";
	КонецЕсли;
	
	УстановитьВидимостьДоступностьНаСервере();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура УсловияРегистрацииСобытия(Команда)
	
	Если ПустаяСтрока(АдресСхемыКомпоновкиДанных)
		Или ПустаяСтрока(АдресНастроекКомпоновкиДанных) Тогда
		СтандартнаяСхемаУсловийДляСобытияНаСервере(Объект, АдресСхемыКомпоновкиДанных, АдресНастроекКомпоновкиДанных)
	КонецЕсли;
	
	ПараметрыРедактированияУсловий = Новый Структура;
	ПараметрыРедактированияУсловий.Вставить("ТипИсточника", Объект.ИсточникСобытия);
	ПараметрыРедактированияУсловий.Вставить("ИмяИсточника", Объект.Регистратор);
	ПараметрыРедактированияУсловий.Вставить("АдресСхемыКомпоновкиДанных", АдресСхемыКомпоновкиДанных);
	ПараметрыРедактированияУсловий.Вставить("АдресНастроекКомпоновкиДанных", АдресНастроекКомпоновкиДанных);
	ПараметрыРедактированияУсловий.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	
	ОткрытьФорму("Справочник.ПЛ_События.Форма.РедактированиеУсловий",
		ПараметрыРедактированияУсловий,
		ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СхемаКомпоновкиРегламентнойПроверки(Команда)
	
	ПараметрыРедактированияСКД = Новый Структура;
	ПараметрыРедактированияСКД.Вставить("АдресСхемыКомпоновкиДанных", АдресСхемыРегламентнойПроверки);
	ПараметрыРедактированияСКД.Вставить("АдресНастроекКомпоновкиДанных", АдресНастроекРегламентнойПроверки);
	ПараметрыРедактированияСКД.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	
	ОткрытьФорму("Справочник.ПЛ_События.Форма.НастройкаСхемыКомпоновкиРегламентнойПроверки",
		ПараметрыРедактированияСКД,
		ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизвольноеРасписание(Команда)
	
	ИзменитьРасписаниеВДиалоге();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ПриСозданииЧтенииНаСервере()
	
	Платформа83 = ПЛ_УведомленияОСобытиях.Платформа83();
	
	СхемаУсловий = Объект.Ссылка.СхемаУсловийРегистрацииСобытия.Получить();
	НастройкиУсловий = Объект.Ссылка.НастройкиУсловийРегистрацииСобытия.Получить();
	
	Если СхемаУсловий <> Неопределено
		И НастройкиУсловий <> Неопределено Тогда
		АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаУсловий, Новый УникальныйИдентификатор());
		АдресНастроекКомпоновкиДанных = ПоместитьВоВременноеХранилище(НастройкиУсловий, Новый УникальныйИдентификатор());
		СтрокаУсловий = Строка(НастройкиУсловий.Отбор);
	Иначе
		АдресСхемыКомпоновкиДанных = "";
		АдресНастроекКомпоновкиДанных = "";
		СтрокаУсловий = "";
	КонецЕсли;
	
	СформироватьЗаголовокНастройкиУсловийНаСервере(СтрокаУсловий);
	
	СхемаРегламентнойПроверки = Объект.Ссылка.СхемаРегламентнойПроверки.Получить();
	НастройкиРегламентнойПроверки = Объект.Ссылка.НастройкиРегламентнойПроверки.Получить();
	
	Если СхемаРегламентнойПроверки <> Неопределено
		И НастройкиРегламентнойПроверки <> Неопределено Тогда
		АдресСхемыРегламентнойПроверки = ПоместитьВоВременноеХранилище(СхемаРегламентнойПроверки, Новый УникальныйИдентификатор());
		АдресНастроекРегламентнойПроверки = ПоместитьВоВременноеХранилище(НастройкиРегламентнойПроверки, Новый УникальныйИдентификатор());
		Элементы.СхемаКомпоновкиРегламентнойПроверки.Заголовок = "Настроить схему компоновки";
	Иначе
		АдресСхемыРегламентнойПроверки = "";
		АдресНастроекРегламентнойПроверки = "";
		Элементы.СхемаКомпоновкиРегламентнойПроверки.Заголовок = "Создать схему компоновки";
	КонецЕсли;
	
	ПрочитатьРасписание();
	НеСтандартноеНаименование = Истина;
	Запуск = ?(ЗначениеЗаполнено(Объект.РегламентноеЗадание), 1, 0) Или Не ЗначениеЗаполнено(Объект.Ссылка);
	
	УстановитьВидимостьДоступностьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьНаСервере()
	
	РегламентнаяПроверка = (Объект.ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.РегламентнаяПроверка);
	Рассылка = (Объект.ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.Рассылка);
	
	Если РегламентнаяПроверка Тогда
		Элементы.СтраницыПараметры.ТекущаяСтраница = Элементы.СтраницаПараметрыРегламентнойПроверки;
	ИначеЕсли Рассылка Тогда
		Элементы.СтраницыПараметры.ТекущаяСтраница = Элементы.СтраницаПараметрыРассылки;
	Иначе
		Элементы.СтраницыПараметры.ТекущаяСтраница = Элементы.СтраницаПараметрыСтатичногоИсточника;
		Элементы.УсловияРегистрацииСобытия.Доступность = ЗначениеЗаполнено(Объект.Регистратор);
	КонецЕсли;
	
	Элементы.ДекорацияКартинкаЧасы.Видимость = Запуск;
	Элементы.НадписьВыполнить.Видимость = Запуск;
	Элементы.ДатаНачалаВыполнения.Видимость = Запуск;
	Элементы.ПериодичностьРегламентнойПроверки.Видимость = Не Рассылка И Запуск;
	
	ВидимостьДатыКонца = Не (Объект.ПериодичностьРегламентнойПроверки = Перечисления.ПЛ_ПериодичностьРегламентныхПроверок.Никогда
		Или Объект.ПериодичностьРегламентнойПроверки = Перечисления.ПЛ_ПериодичностьРегламентныхПроверок.ГибкоеРасписание)
		И Запуск;
		
	Элементы.ДатаКонцаВыполнения.Видимость = ВидимостьДатыКонца И Запуск;
	
	Элементы.НадписьВыполнить.Заголовок = "Выполнить: " + Формат(ДатаНачалаВыполнения, "ДФ=ddd") + ",";
	
	ВидимостьНастройкиРасписания = (Объект.ПериодичностьРегламентнойПроверки = Перечисления.ПЛ_ПериодичностьРегламентныхПроверок.ГибкоеРасписание);
	Элементы.НастроитьРасписание.Видимость = ВидимостьНастройкиРасписания;
	Элементы.СтрокаПроизвольноеРасписание.Видимость = ВидимостьНастройкиРасписания;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЗаголовкиПолей()

	Если Объект.ИсточникСобытия = ПредопределенноеЗначение("Перечисление.ПЛ_ИсточникиСобытий.ИсточникДокумент")
		Или Объект.ИсточникСобытия = ПредопределенноеЗначение("Перечисление.ПЛ_ИсточникиСобытий.ИсточникЗаписьДокумента") Тогда
		Элементы.ПредставлениеРегистратора.Заголовок = "Имя документа";
	ИначеЕсли Объект.ИсточникСобытия = ПредопределенноеЗначение("Перечисление.ПЛ_ИсточникиСобытий.ИсточникСправочник") Тогда
		Элементы.ПредставлениеРегистратора.Заголовок = "Имя справочника";
	ИначеЕсли Объект.ИсточникСобытия = ПредопределенноеЗначение("Перечисление.ПЛ_ИсточникиСобытий.ИсточникРегистрСведений") Тогда
		Элементы.ПредставлениеРегистратора.Заголовок = "Регистр сведений";
	КонецЕсли;
	
	Элементы.УсловияРегистрацииСобытия.Заголовок = "Задать условия обработки события";
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СтандартнаяСхемаУсловийДляСобытияНаСервере(Знач Событие, АдресСхемыКомпоновкиДанных, АдресНастроекКомпоновкиДанных)
	
	ОбъектСобытие = ДанныеФормыВЗначение(Событие, Тип("СправочникОбъект.ПЛ_События"));
	
	СхемаИНастройки = ОбъектСобытие.СтандартнаяСхемаУсловийДляСобытия();
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаИНастройки.СКД, Новый УникальныйИдентификатор());
	АдресНастроекКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаИНастройки.Настройки, Новый УникальныйИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименованиеСобытия()
	
	Если Не ЗначениеЗаполнено(Объект.Наименование)
		Или Не НеСтандартноеНаименование Тогда
		ТекстНаименования = "";
		Если Объект.ИсточникСобытия = ПредопределенноеЗначение("Перечисление.ПЛ_ИсточникиСобытий.ИсточникДокумент") Тогда
			ТекстНаименования = ТекстНаименования + "Проведение документа ";
		ИначеЕсли Объект.ИсточникСобытия = ПредопределенноеЗначение("Перечисление.ПЛ_ИсточникиСобытий.ИсточникЗаписьДокумента") Тогда
			ТекстНаименования = ТекстНаименования + "Запись документа ";
		ИначеЕсли Объект.ИсточникСобытия = ПредопределенноеЗначение("Перечисление.ПЛ_ИсточникиСобытий.ИсточникСправочник") Тогда
			ТекстНаименования = ТекстНаименования + "Запись справочника ";
		ИначеЕсли Объект.ИсточникСобытия = ПредопределенноеЗначение("Перечисление.ПЛ_ИсточникиСобытий.ИсточникРегистрСведений") Тогда
			ТекстНаименования = ТекстНаименования + "Запись сведений ";
		КонецЕсли;
		ТекстНаименования = ТекстНаименования + Объект.ПредставлениеРегистратора;
	
		Объект.Наименование = ТекстНаименования;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьИзменениеУсловий(СтруктураРезультата)
	
	ЭтаФорма.АдресСхемыКомпоновкиДанных = СтруктураРезультата.АдресСхемы;
	ЭтаФорма.АдресНастроекКомпоновкиДанных = СтруктураРезультата.АдресНастроек;
	
	НастройкиУсловий = ПолучитьИзВременногоХранилища(СтруктураРезультата.АдресНастроек);
	
	Если ЗначениеЗаполнено(НастройкиУсловий)
		И НастройкиУсловий.Отбор.Элементы.Количество() Тогда
		Объект.ВидУсловийРегистрацииСобытия = Перечисления.ПЛ_ВидыУсловийУведомлений.ОтборПоИсточнику;
		СформироватьЗаголовокНастройкиУсловийНаСервере(Строка(НастройкиУсловий.Отбор));
	Иначе
		Объект.ВидУсловийРегистрацииСобытия = Перечисления.ПЛ_ВидыУсловийУведомлений.БезУсловия;
		СформироватьЗаголовокНастройкиУсловийНаСервере("");
	КонецЕсли;
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьИзменениеСхемыРегламентнойПроверки(СтруктураРезультата)
	
	ЭтаФорма.АдресСхемыРегламентнойПроверки = СтруктураРезультата.АдресСхемы;
	ЭтаФорма.АдресНастроекРегламентнойПроверки = СтруктураРезультата.АдресНастроек;
	
	Элементы.СхемаКомпоновкиРегламентнойПроверки.Заголовок = "Настроить схему компоновки";
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаголовокНастройкиУсловийНаСервере(СтрокаУсловий)

	Если Объект.ВидУсловийРегистрацииСобытия = Перечисления.ПЛ_ВидыУсловийУведомлений.БезУсловия Тогда
		СтрокаУсловий = "Задать условия обработки события";
	ИначеЕсли Объект.ВидУсловийРегистрацииСобытия = Перечисления.ПЛ_ВидыУсловийУведомлений.ОтборПоИсточнику Тогда
		СтрокаУсловий = "Условия обработки события: " + СтрокаУсловий;
	КонецЕсли;
	
	Элементы.УсловияРегистрацииСобытия.Заголовок = СтрокаУсловий;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьРасписание()
	
	УстановитьПривилегированныйРежим(Истина);
	ИдентификаторЗадания = ?(СозданКопированием, ЗначениеКопирования.РегламентноеЗадание, Объект.РегламентноеЗадание);
	Если ТипЗнч(ИдентификаторЗадания) = Тип("УникальныйИдентификатор") Тогда
		Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
		Если Задание <> Неопределено Тогда
			Расписание = Задание.Расписание;
			ДатаНачалаВыполнения = Расписание.ДатаНачала;
			ДатаКонцаВыполнения = Расписание.ДатаКонца;
			СтрокаПроизвольноеРасписание = Строка(Расписание);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасписание()
	
	Расписание = Новый РасписаниеРегламентногоЗадания;
	
	Расписание.ДатаНачала = ДатаНачалаВыполнения;
	Расписание.ВремяНачала = ДатаНачалаВыполнения;
	
	Если Объект.ПериодичностьРегламентнойПроверки = Перечисления.ПЛ_ПериодичностьРегламентныхПроверок.КаждыйДень Тогда
		
		Расписание.ПериодПовтораДней = 1;
		
	ИначеЕсли Объект.ПериодичностьРегламентнойПроверки = Перечисления.ПЛ_ПериодичностьРегламентныхПроверок.КаждуюНеделю Тогда
		
		Расписание.ПериодПовтораДней = 1;
		
		МассивДнейНедели = Новый Массив;
		МассивДнейНедели.Добавить(ДеньНедели(ДатаНачалаВыполнения));
		
		Расписание.ДниНедели = МассивДнейНедели;
		
	ИначеЕсли Объект.ПериодичностьРегламентнойПроверки = Перечисления.ПЛ_ПериодичностьРегламентныхПроверок.РазВДвеНедели Тогда
		
		Расписание.ПериодПовтораДней = 1;
		
		МассивДнейНедели = Новый Массив;
		МассивДнейНедели.Добавить(ДеньНедели(ДатаНачалаВыполнения));
		
		Расписание.ДниНедели = МассивДнейНедели;
		Расписание.ПериодНедель = 2;
		
	ИначеЕсли Объект.ПериодичностьРегламентнойПроверки = Перечисления.ПЛ_ПериодичностьРегламентныхПроверок.КаждыйМесяц Тогда
		
		Расписание.ПериодПовтораДней = 1;
		
		МассивМесяцев = Новый Массив;
		Для инд = 1 по 12 Цикл
			МассивМесяцев.Добавить(инд);
		КонецЦикла;
		
		// Считаем, что если задан последний день месяца, то повторять задание нужно в последний день, независимо от длины месяца
		ДнейВМесяце = День(КонецМесяца(ДатаНачалаВыполнения));
		ДеньМесяца = День(ДатаНачалаВыполнения);
		Если ДеньМесяца = ДнейВМесяце Тогда
			ДеньМесяца = -1;
		КонецЕсли;
		
		Расписание.Месяцы = МассивМесяцев;
		Расписание.ДеньВМесяце = ДеньМесяца;
		
	ИначеЕсли Объект.ПериодичностьРегламентнойПроверки = Перечисления.ПЛ_ПериодичностьРегламентныхПроверок.КаждыйГод Тогда
		
		Расписание.ПериодПовтораДней = 1;
		
		МассивМесяцев = Новый Массив;
		МассивМесяцев.Добавить(Месяц(ДатаНачалаВыполнения));
		ДеньМесяца = День(ДатаНачалаВыполнения);
		
		Расписание.Месяцы = МассивМесяцев;
		Расписание.ДеньВМесяце = ДеньМесяца;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРасписаниеВДиалоге()
	
	Модифицированность = Истина;
	
	Расписание.ДатаНачала = ДатаНачалаВыполнения;
	Расписание.ВремяНачала = ДатаНачалаВыполнения;
	
	ДиалогРасписания = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	
	Если Платформа83 Тогда
		ОповещениеВыборРасписания = "";
		Выполнить("ОповещениеВыборРасписания = Новый ОписаниеОповещения(""ОповещениеВыборРасписанияЗавершение"", ЭтаФорма)");
		Выполнить("ДиалогРасписания.Показать(ОповещениеВыборРасписания)");
	Иначе
		Если ДиалогРасписания.ОткрытьМодально() Тогда
			Расписание = ДиалогРасписания.Расписание;
			СтрокаПроизвольноеРасписание = Строка(Расписание);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВыборРасписанияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Расписание = Результат;
		СтрокаПроизвольноеРасписание = Строка(Расписание);
	КонецЕсли;
	
КонецПроцедуры
